** 5° Yaw Angle


*** 1. Backup test


#+RESULTS: TEST Backup


#+BEGIN_SRC bash :dir "M:\\fluentYaw5\\"
  pwd
  ls sphere*.cas|awk -F"-" 'BEGIN{i=1}{print substr($5,0,length($5)-4),",",i; i=i+1}'
#+END_SRC

#+RESULTS:
| 16.689859 |   1 |
|  16.70145 |   2 |
| 16.713039 |   3 |
|  16.72463 |   4 |
| 16.736221 |   5 |
| 16.747812 |   6 |
| 16.759401 |   7 |
| 16.770992 |   8 |
| 16.782581 |   9 |
| 16.794172 |  10 |
| 16.805763 |  11 |
| 16.817352 |  12 |
| 16.828943 |  13 |
| 16.840532 |  14 |
| 16.852123 |  15 |
| 16.863714 |  16 |
| 16.875303 |  17 |
| 16.886894 |  18 |
| 16.898483 |  19 |
| 16.910074 |  20 |
| 16.921663 |  21 |
| 16.933254 |  22 |
| 16.944845 |  23 |
| 16.956434 |  24 |
| 16.968025 |  25 |
| 16.979614 |  26 |
| 16.991205 |  27 |
| 17.002796 |  28 |
| 17.014385 |  29 |
| 17.025976 |  30 |
| 17.037565 |  31 |
| 17.049156 |  32 |
| 17.060747 |  33 |
| 17.072336 |  34 |
| 17.083927 |  35 |
| 17.095516 |  36 |
| 17.107107 |  37 |
| 17.118698 |  38 |
| 17.130287 |  39 |
| 17.141878 |  40 |
| 17.153467 |  41 |
| 17.165058 |  42 |
| 17.176649 |  43 |
| 17.188238 |  44 |
| 17.199829 |  45 |
| 17.211418 |  46 |
| 17.223009 |  47 |
| 17.234598 |  48 |
| 17.246189 |  49 |
|  17.25778 |  50 |
| 17.269369 |  51 |
|  17.28096 |  52 |
| 17.292549 |  53 |
|  17.30414 |  54 |
| 17.315731 |  55 |
|  17.32732 |  56 |
| 17.338911 |  57 |
|   17.3505 |  58 |
| 17.362091 |  59 |
| 17.373682 |  60 |
| 17.385271 |  61 |
| 17.396862 |  62 |
| 17.408451 |  63 |
| 17.420042 |  64 |
| 17.431633 |  65 |
| 17.443222 |  66 |
| 17.454813 |  67 |
| 17.466402 |  68 |
| 17.477993 |  69 |
| 17.489584 |  70 |
| 17.501173 |  71 |
| 17.512764 |  72 |
| 17.524353 |  73 |
| 17.535944 |  74 |
| 17.547535 |  75 |
| 17.559124 |  76 |
| 17.570715 |  77 |
| 17.582304 |  78 |
| 17.593895 |  79 |
| 17.605484 |  80 |
| 17.617075 |  81 |
| 17.628666 |  82 |
| 17.640255 |  83 |
| 17.651846 |  84 |
| 17.663435 |  85 |
| 17.675026 |  86 |
| 17.686617 |  87 |
| 17.698206 |  88 |
| 17.709797 |  89 |
| 17.721386 |  90 |
| 17.732977 |  91 |
| 17.744568 |  92 |
| 17.756157 |  93 |
| 17.767748 |  94 |
| 17.779337 |  95 |
| 17.790928 |  96 |
| 17.802519 |  97 |
| 17.814108 |  98 |
| 17.825699 |  99 |
| 17.837288 | 100 |
| 17.848879 | 101 |
|  17.86047 | 102 |
| 17.872059 | 103 |
|  17.88365 | 104 |
| 17.895239 | 105 |
|  17.90683 | 106 |
| 17.918419 | 107 |
|  17.93001 | 108 |
| 17.941601 | 109 |
|  17.95319 | 110 |
| 17.964781 | 111 |
|  17.97637 | 112 |
| 17.987961 | 113 |
| 17.999552 | 114 |
| 18.011141 | 115 |
| 18.022732 | 116 |
| 18.034321 | 117 |
| 18.045912 | 118 |
| 18.057503 | 119 |
| 18.069092 | 120 |
| 18.080683 | 121 |
| 18.092272 | 122 |
| 18.103863 | 123 |
| 18.115454 | 124 |
| 18.127043 | 125 |
| 18.138634 | 126 |
| 18.150223 | 127 |
| 18.161814 | 128 |
| 18.173405 | 129 |
| 18.184994 | 130 |
| 18.196585 | 131 |
| 18.208174 | 132 |
| 18.219765 | 133 |
| 18.231354 | 134 |
| 18.242945 | 135 |
| 18.254536 | 136 |
| 18.266125 | 137 |
| 18.277716 | 138 |
| 18.289305 | 139 |
| 18.300896 | 140 |
| 18.312487 | 141 |
| 18.324076 | 142 |
| 18.335667 | 143 |
| 18.347256 | 144 |
| 18.358847 | 145 |
| 18.370438 | 146 |
| 18.382027 | 147 |
| 18.393618 | 148 |
| 18.405207 | 149 |
| 18.416798 | 150 |
| 18.428387 | 151 |
| 18.439978 | 152 |
| 18.451567 | 153 |
| 18.463158 | 154 |
| 18.474749 | 155 |
| 18.486338 | 156 |
| 18.497929 | 157 |
| 18.509518 | 158 |
| 18.521109 | 159 |
|   18.5327 | 160 |
| 18.544289 | 161 |
|  18.55588 | 162 |
| 18.567469 | 163 |
|  18.57906 | 164 |
| 18.590649 | 165 |
|  18.60224 | 166 |
| 18.613831 | 167 |
|  18.62542 | 168 |
| 18.637011 | 169 |
|   18.6486 | 170 |
| 18.660191 | 171 |
| 18.671782 | 172 |
| 18.683371 | 173 |
| 18.694962 | 174 |
| 18.706551 | 175 |
| 18.718142 | 176 |
| 18.729733 | 177 |
| 18.741322 | 178 |
| 18.752913 | 179 |
| 18.764502 | 180 |
| 18.776093 | 181 |
| 18.787683 | 182 |
| 18.799273 | 183 |
| 18.810863 | 184 |
| 18.822453 | 185 |


***  1.1 Backup

#+NAME: Backup
#+BEGIN_SRC bash :result value :dir M:\\FLUENTYAW5\\
      pwd
  #  ls *.cas|awk -F"-" '{print $5}'
#  ls sphere*.cas|awk -F"-" 'BEGIN{i=1}{print substr($5,0,length($5)-8),",",i; i=i+1}'
# 
ls sphere*.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-5-1.csv";}{print substr($5,0,length($5)-4),",",i >prefix; i=i+1}' 

#+END_SRC

#+RESULTS: Backup

*** 2. Rename test

****  cas


#+NAME: TEST  rename cas file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw5"
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-5-1-";postfix=".cas"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "sprintf("%03d",i)" "originalFile""postfix;i=i+1;print(cmd);}'

#+END_SRC

#+RESULTS: TEST  rename cas file to 1,2,3
| rename | sphere12-14-5-1-16.689859 |   1 | sphere12-14-5-1-16.689859.cas |
| rename | sphere12-14-5-1-16.701450 |   2 | sphere12-14-5-1-16.701450.cas |
| rename | sphere12-14-5-1-16.713039 |   3 | sphere12-14-5-1-16.713039.cas |
| rename | sphere12-14-5-1-16.724630 |   4 | sphere12-14-5-1-16.724630.cas |
| rename | sphere12-14-5-1-16.736221 |   5 | sphere12-14-5-1-16.736221.cas |
| rename | sphere12-14-5-1-16.747812 |   6 | sphere12-14-5-1-16.747812.cas |
| rename | sphere12-14-5-1-16.759401 |   7 | sphere12-14-5-1-16.759401.cas |
| rename | sphere12-14-5-1-16.770992 |   8 | sphere12-14-5-1-16.770992.cas |
| rename | sphere12-14-5-1-16.782581 |   9 | sphere12-14-5-1-16.782581.cas |
| rename | sphere12-14-5-1-16.794172 |  10 | sphere12-14-5-1-16.794172.cas |
| rename | sphere12-14-5-1-16.805763 |  11 | sphere12-14-5-1-16.805763.cas |
| rename | sphere12-14-5-1-16.817352 |  12 | sphere12-14-5-1-16.817352.cas |
| rename | sphere12-14-5-1-16.828943 |  13 | sphere12-14-5-1-16.828943.cas |
| rename | sphere12-14-5-1-16.840532 |  14 | sphere12-14-5-1-16.840532.cas |
| rename | sphere12-14-5-1-16.852123 |  15 | sphere12-14-5-1-16.852123.cas |
| rename | sphere12-14-5-1-16.863714 |  16 | sphere12-14-5-1-16.863714.cas |
| rename | sphere12-14-5-1-16.875303 |  17 | sphere12-14-5-1-16.875303.cas |
| rename | sphere12-14-5-1-16.886894 |  18 | sphere12-14-5-1-16.886894.cas |
| rename | sphere12-14-5-1-16.898483 |  19 | sphere12-14-5-1-16.898483.cas |
| rename | sphere12-14-5-1-16.910074 |  20 | sphere12-14-5-1-16.910074.cas |
| rename | sphere12-14-5-1-16.921663 |  21 | sphere12-14-5-1-16.921663.cas |
| rename | sphere12-14-5-1-16.933254 |  22 | sphere12-14-5-1-16.933254.cas |
| rename | sphere12-14-5-1-16.944845 |  23 | sphere12-14-5-1-16.944845.cas |
| rename | sphere12-14-5-1-16.956434 |  24 | sphere12-14-5-1-16.956434.cas |
| rename | sphere12-14-5-1-16.968025 |  25 | sphere12-14-5-1-16.968025.cas |
| rename | sphere12-14-5-1-16.979614 |  26 | sphere12-14-5-1-16.979614.cas |
| rename | sphere12-14-5-1-16.991205 |  27 | sphere12-14-5-1-16.991205.cas |
| rename | sphere12-14-5-1-17.002796 |  28 | sphere12-14-5-1-17.002796.cas |
| rename | sphere12-14-5-1-17.014385 |  29 | sphere12-14-5-1-17.014385.cas |
| rename | sphere12-14-5-1-17.025976 |  30 | sphere12-14-5-1-17.025976.cas |
| rename | sphere12-14-5-1-17.037565 |  31 | sphere12-14-5-1-17.037565.cas |
| rename | sphere12-14-5-1-17.049156 |  32 | sphere12-14-5-1-17.049156.cas |
| rename | sphere12-14-5-1-17.060747 |  33 | sphere12-14-5-1-17.060747.cas |
| rename | sphere12-14-5-1-17.072336 |  34 | sphere12-14-5-1-17.072336.cas |
| rename | sphere12-14-5-1-17.083927 |  35 | sphere12-14-5-1-17.083927.cas |
| rename | sphere12-14-5-1-17.095516 |  36 | sphere12-14-5-1-17.095516.cas |
| rename | sphere12-14-5-1-17.107107 |  37 | sphere12-14-5-1-17.107107.cas |
| rename | sphere12-14-5-1-17.118698 |  38 | sphere12-14-5-1-17.118698.cas |
| rename | sphere12-14-5-1-17.130287 |  39 | sphere12-14-5-1-17.130287.cas |
| rename | sphere12-14-5-1-17.141878 |  40 | sphere12-14-5-1-17.141878.cas |
| rename | sphere12-14-5-1-17.153467 |  41 | sphere12-14-5-1-17.153467.cas |
| rename | sphere12-14-5-1-17.165058 |  42 | sphere12-14-5-1-17.165058.cas |
| rename | sphere12-14-5-1-17.176649 |  43 | sphere12-14-5-1-17.176649.cas |
| rename | sphere12-14-5-1-17.188238 |  44 | sphere12-14-5-1-17.188238.cas |
| rename | sphere12-14-5-1-17.199829 |  45 | sphere12-14-5-1-17.199829.cas |
| rename | sphere12-14-5-1-17.211418 |  46 | sphere12-14-5-1-17.211418.cas |
| rename | sphere12-14-5-1-17.223009 |  47 | sphere12-14-5-1-17.223009.cas |
| rename | sphere12-14-5-1-17.234598 |  48 | sphere12-14-5-1-17.234598.cas |
| rename | sphere12-14-5-1-17.246189 |  49 | sphere12-14-5-1-17.246189.cas |
| rename | sphere12-14-5-1-17.257780 |  50 | sphere12-14-5-1-17.257780.cas |
| rename | sphere12-14-5-1-17.269369 |  51 | sphere12-14-5-1-17.269369.cas |
| rename | sphere12-14-5-1-17.280960 |  52 | sphere12-14-5-1-17.280960.cas |
| rename | sphere12-14-5-1-17.292549 |  53 | sphere12-14-5-1-17.292549.cas |
| rename | sphere12-14-5-1-17.304140 |  54 | sphere12-14-5-1-17.304140.cas |
| rename | sphere12-14-5-1-17.315731 |  55 | sphere12-14-5-1-17.315731.cas |
| rename | sphere12-14-5-1-17.327320 |  56 | sphere12-14-5-1-17.327320.cas |
| rename | sphere12-14-5-1-17.338911 |  57 | sphere12-14-5-1-17.338911.cas |
| rename | sphere12-14-5-1-17.350500 |  58 | sphere12-14-5-1-17.350500.cas |
| rename | sphere12-14-5-1-17.362091 |  59 | sphere12-14-5-1-17.362091.cas |
| rename | sphere12-14-5-1-17.373682 |  60 | sphere12-14-5-1-17.373682.cas |
| rename | sphere12-14-5-1-17.385271 |  61 | sphere12-14-5-1-17.385271.cas |
| rename | sphere12-14-5-1-17.396862 |  62 | sphere12-14-5-1-17.396862.cas |
| rename | sphere12-14-5-1-17.408451 |  63 | sphere12-14-5-1-17.408451.cas |
| rename | sphere12-14-5-1-17.420042 |  64 | sphere12-14-5-1-17.420042.cas |
| rename | sphere12-14-5-1-17.431633 |  65 | sphere12-14-5-1-17.431633.cas |
| rename | sphere12-14-5-1-17.443222 |  66 | sphere12-14-5-1-17.443222.cas |
| rename | sphere12-14-5-1-17.454813 |  67 | sphere12-14-5-1-17.454813.cas |
| rename | sphere12-14-5-1-17.466402 |  68 | sphere12-14-5-1-17.466402.cas |
| rename | sphere12-14-5-1-17.477993 |  69 | sphere12-14-5-1-17.477993.cas |
| rename | sphere12-14-5-1-17.489584 |  70 | sphere12-14-5-1-17.489584.cas |
| rename | sphere12-14-5-1-17.501173 |  71 | sphere12-14-5-1-17.501173.cas |
| rename | sphere12-14-5-1-17.512764 |  72 | sphere12-14-5-1-17.512764.cas |
| rename | sphere12-14-5-1-17.524353 |  73 | sphere12-14-5-1-17.524353.cas |
| rename | sphere12-14-5-1-17.535944 |  74 | sphere12-14-5-1-17.535944.cas |
| rename | sphere12-14-5-1-17.547535 |  75 | sphere12-14-5-1-17.547535.cas |
| rename | sphere12-14-5-1-17.559124 |  76 | sphere12-14-5-1-17.559124.cas |
| rename | sphere12-14-5-1-17.570715 |  77 | sphere12-14-5-1-17.570715.cas |
| rename | sphere12-14-5-1-17.582304 |  78 | sphere12-14-5-1-17.582304.cas |
| rename | sphere12-14-5-1-17.593895 |  79 | sphere12-14-5-1-17.593895.cas |
| rename | sphere12-14-5-1-17.605484 |  80 | sphere12-14-5-1-17.605484.cas |
| rename | sphere12-14-5-1-17.617075 |  81 | sphere12-14-5-1-17.617075.cas |
| rename | sphere12-14-5-1-17.628666 |  82 | sphere12-14-5-1-17.628666.cas |
| rename | sphere12-14-5-1-17.640255 |  83 | sphere12-14-5-1-17.640255.cas |
| rename | sphere12-14-5-1-17.651846 |  84 | sphere12-14-5-1-17.651846.cas |
| rename | sphere12-14-5-1-17.663435 |  85 | sphere12-14-5-1-17.663435.cas |
| rename | sphere12-14-5-1-17.675026 |  86 | sphere12-14-5-1-17.675026.cas |
| rename | sphere12-14-5-1-17.686617 |  87 | sphere12-14-5-1-17.686617.cas |
| rename | sphere12-14-5-1-17.698206 |  88 | sphere12-14-5-1-17.698206.cas |
| rename | sphere12-14-5-1-17.709797 |  89 | sphere12-14-5-1-17.709797.cas |
| rename | sphere12-14-5-1-17.721386 |  90 | sphere12-14-5-1-17.721386.cas |
| rename | sphere12-14-5-1-17.732977 |  91 | sphere12-14-5-1-17.732977.cas |
| rename | sphere12-14-5-1-17.744568 |  92 | sphere12-14-5-1-17.744568.cas |
| rename | sphere12-14-5-1-17.756157 |  93 | sphere12-14-5-1-17.756157.cas |
| rename | sphere12-14-5-1-17.767748 |  94 | sphere12-14-5-1-17.767748.cas |
| rename | sphere12-14-5-1-17.779337 |  95 | sphere12-14-5-1-17.779337.cas |
| rename | sphere12-14-5-1-17.790928 |  96 | sphere12-14-5-1-17.790928.cas |
| rename | sphere12-14-5-1-17.802519 |  97 | sphere12-14-5-1-17.802519.cas |
| rename | sphere12-14-5-1-17.814108 |  98 | sphere12-14-5-1-17.814108.cas |
| rename | sphere12-14-5-1-17.825699 |  99 | sphere12-14-5-1-17.825699.cas |
| rename | sphere12-14-5-1-17.837288 | 100 | sphere12-14-5-1-17.837288.cas |
| rename | sphere12-14-5-1-17.848879 | 101 | sphere12-14-5-1-17.848879.cas |
| rename | sphere12-14-5-1-17.860470 | 102 | sphere12-14-5-1-17.860470.cas |
| rename | sphere12-14-5-1-17.872059 | 103 | sphere12-14-5-1-17.872059.cas |
| rename | sphere12-14-5-1-17.883650 | 104 | sphere12-14-5-1-17.883650.cas |
| rename | sphere12-14-5-1-17.895239 | 105 | sphere12-14-5-1-17.895239.cas |
| rename | sphere12-14-5-1-17.906830 | 106 | sphere12-14-5-1-17.906830.cas |
| rename | sphere12-14-5-1-17.918419 | 107 | sphere12-14-5-1-17.918419.cas |
| rename | sphere12-14-5-1-17.930010 | 108 | sphere12-14-5-1-17.930010.cas |
| rename | sphere12-14-5-1-17.941601 | 109 | sphere12-14-5-1-17.941601.cas |
| rename | sphere12-14-5-1-17.953190 | 110 | sphere12-14-5-1-17.953190.cas |
| rename | sphere12-14-5-1-17.964781 | 111 | sphere12-14-5-1-17.964781.cas |
| rename | sphere12-14-5-1-17.976370 | 112 | sphere12-14-5-1-17.976370.cas |
| rename | sphere12-14-5-1-17.987961 | 113 | sphere12-14-5-1-17.987961.cas |
| rename | sphere12-14-5-1-17.999552 | 114 | sphere12-14-5-1-17.999552.cas |
| rename | sphere12-14-5-1-18.011141 | 115 | sphere12-14-5-1-18.011141.cas |
| rename | sphere12-14-5-1-18.022732 | 116 | sphere12-14-5-1-18.022732.cas |
| rename | sphere12-14-5-1-18.034321 | 117 | sphere12-14-5-1-18.034321.cas |
| rename | sphere12-14-5-1-18.045912 | 118 | sphere12-14-5-1-18.045912.cas |
| rename | sphere12-14-5-1-18.057503 | 119 | sphere12-14-5-1-18.057503.cas |
| rename | sphere12-14-5-1-18.069092 | 120 | sphere12-14-5-1-18.069092.cas |
| rename | sphere12-14-5-1-18.080683 | 121 | sphere12-14-5-1-18.080683.cas |
| rename | sphere12-14-5-1-18.092272 | 122 | sphere12-14-5-1-18.092272.cas |
| rename | sphere12-14-5-1-18.103863 | 123 | sphere12-14-5-1-18.103863.cas |
| rename | sphere12-14-5-1-18.115454 | 124 | sphere12-14-5-1-18.115454.cas |
| rename | sphere12-14-5-1-18.127043 | 125 | sphere12-14-5-1-18.127043.cas |
| rename | sphere12-14-5-1-18.138634 | 126 | sphere12-14-5-1-18.138634.cas |
| rename | sphere12-14-5-1-18.150223 | 127 | sphere12-14-5-1-18.150223.cas |
| rename | sphere12-14-5-1-18.161814 | 128 | sphere12-14-5-1-18.161814.cas |
| rename | sphere12-14-5-1-18.173405 | 129 | sphere12-14-5-1-18.173405.cas |
| rename | sphere12-14-5-1-18.184994 | 130 | sphere12-14-5-1-18.184994.cas |
| rename | sphere12-14-5-1-18.196585 | 131 | sphere12-14-5-1-18.196585.cas |
| rename | sphere12-14-5-1-18.208174 | 132 | sphere12-14-5-1-18.208174.cas |
| rename | sphere12-14-5-1-18.219765 | 133 | sphere12-14-5-1-18.219765.cas |
| rename | sphere12-14-5-1-18.231354 | 134 | sphere12-14-5-1-18.231354.cas |
| rename | sphere12-14-5-1-18.242945 | 135 | sphere12-14-5-1-18.242945.cas |
| rename | sphere12-14-5-1-18.254536 | 136 | sphere12-14-5-1-18.254536.cas |
| rename | sphere12-14-5-1-18.266125 | 137 | sphere12-14-5-1-18.266125.cas |
| rename | sphere12-14-5-1-18.277716 | 138 | sphere12-14-5-1-18.277716.cas |
| rename | sphere12-14-5-1-18.289305 | 139 | sphere12-14-5-1-18.289305.cas |
| rename | sphere12-14-5-1-18.300896 | 140 | sphere12-14-5-1-18.300896.cas |
| rename | sphere12-14-5-1-18.312487 | 141 | sphere12-14-5-1-18.312487.cas |
| rename | sphere12-14-5-1-18.324076 | 142 | sphere12-14-5-1-18.324076.cas |
| rename | sphere12-14-5-1-18.335667 | 143 | sphere12-14-5-1-18.335667.cas |
| rename | sphere12-14-5-1-18.347256 | 144 | sphere12-14-5-1-18.347256.cas |
| rename | sphere12-14-5-1-18.358847 | 145 | sphere12-14-5-1-18.358847.cas |
| rename | sphere12-14-5-1-18.370438 | 146 | sphere12-14-5-1-18.370438.cas |
| rename | sphere12-14-5-1-18.382027 | 147 | sphere12-14-5-1-18.382027.cas |
| rename | sphere12-14-5-1-18.393618 | 148 | sphere12-14-5-1-18.393618.cas |
| rename | sphere12-14-5-1-18.405207 | 149 | sphere12-14-5-1-18.405207.cas |
| rename | sphere12-14-5-1-18.416798 | 150 | sphere12-14-5-1-18.416798.cas |
| rename | sphere12-14-5-1-18.428387 | 151 | sphere12-14-5-1-18.428387.cas |
| rename | sphere12-14-5-1-18.439978 | 152 | sphere12-14-5-1-18.439978.cas |
| rename | sphere12-14-5-1-18.451567 | 153 | sphere12-14-5-1-18.451567.cas |
| rename | sphere12-14-5-1-18.463158 | 154 | sphere12-14-5-1-18.463158.cas |
| rename | sphere12-14-5-1-18.474749 | 155 | sphere12-14-5-1-18.474749.cas |
| rename | sphere12-14-5-1-18.486338 | 156 | sphere12-14-5-1-18.486338.cas |
| rename | sphere12-14-5-1-18.497929 | 157 | sphere12-14-5-1-18.497929.cas |
| rename | sphere12-14-5-1-18.509518 | 158 | sphere12-14-5-1-18.509518.cas |
| rename | sphere12-14-5-1-18.521109 | 159 | sphere12-14-5-1-18.521109.cas |
| rename | sphere12-14-5-1-18.532700 | 160 | sphere12-14-5-1-18.532700.cas |
| rename | sphere12-14-5-1-18.544289 | 161 | sphere12-14-5-1-18.544289.cas |
| rename | sphere12-14-5-1-18.555880 | 162 | sphere12-14-5-1-18.555880.cas |
| rename | sphere12-14-5-1-18.567469 | 163 | sphere12-14-5-1-18.567469.cas |
| rename | sphere12-14-5-1-18.579060 | 164 | sphere12-14-5-1-18.579060.cas |
| rename | sphere12-14-5-1-18.590649 | 165 | sphere12-14-5-1-18.590649.cas |
| rename | sphere12-14-5-1-18.602240 | 166 | sphere12-14-5-1-18.602240.cas |
| rename | sphere12-14-5-1-18.613831 | 167 | sphere12-14-5-1-18.613831.cas |
| rename | sphere12-14-5-1-18.625420 | 168 | sphere12-14-5-1-18.625420.cas |
| rename | sphere12-14-5-1-18.637011 | 169 | sphere12-14-5-1-18.637011.cas |
| rename | sphere12-14-5-1-18.648600 | 170 | sphere12-14-5-1-18.648600.cas |
| rename | sphere12-14-5-1-18.660191 | 171 | sphere12-14-5-1-18.660191.cas |
| rename | sphere12-14-5-1-18.671782 | 172 | sphere12-14-5-1-18.671782.cas |
| rename | sphere12-14-5-1-18.683371 | 173 | sphere12-14-5-1-18.683371.cas |
| rename | sphere12-14-5-1-18.694962 | 174 | sphere12-14-5-1-18.694962.cas |
| rename | sphere12-14-5-1-18.706551 | 175 | sphere12-14-5-1-18.706551.cas |
| rename | sphere12-14-5-1-18.718142 | 176 | sphere12-14-5-1-18.718142.cas |
| rename | sphere12-14-5-1-18.729733 | 177 | sphere12-14-5-1-18.729733.cas |
| rename | sphere12-14-5-1-18.741322 | 178 | sphere12-14-5-1-18.741322.cas |
| rename | sphere12-14-5-1-18.752913 | 179 | sphere12-14-5-1-18.752913.cas |
| rename | sphere12-14-5-1-18.764502 | 180 | sphere12-14-5-1-18.764502.cas |
| rename | sphere12-14-5-1-18.776093 | 181 | sphere12-14-5-1-18.776093.cas |
| rename | sphere12-14-5-1-18.787683 | 182 | sphere12-14-5-1-18.787683.cas |
| rename | sphere12-14-5-1-18.799273 | 183 | sphere12-14-5-1-18.799273.cas |
| rename | sphere12-14-5-1-18.810863 | 184 | sphere12-14-5-1-18.810863.cas |
| rename | sphere12-14-5-1-18.822453 | 185 | sphere12-14-5-1-18.822453.cas |

****  data
一定要重视测试，现在测试明眼一看就有问题！！！！！！


#+NAME: TEST  rename dat file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw5"
   ls *.dat|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-5-1-";postfix=".dat"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "i" "originalFile""postfix;i=i+1;print(cmd);}'

#+END_SRC

#+RESULTS: TEST  rename dat file to 1,2,3
| rename | sphere12-14-5-1-16.689859 |   1 | sphere12-14-5-1-16.689859.dat |
| rename | sphere12-14-5-1-16.701450 |   2 | sphere12-14-5-1-16.701450.dat |
| rename | sphere12-14-5-1-16.713039 |   3 | sphere12-14-5-1-16.713039.dat |
| rename | sphere12-14-5-1-16.724630 |   4 | sphere12-14-5-1-16.724630.dat |
| rename | sphere12-14-5-1-16.736221 |   5 | sphere12-14-5-1-16.736221.dat |
| rename | sphere12-14-5-1-16.747812 |   6 | sphere12-14-5-1-16.747812.dat |
| rename | sphere12-14-5-1-16.759401 |   7 | sphere12-14-5-1-16.759401.dat |
| rename | sphere12-14-5-1-16.770992 |   8 | sphere12-14-5-1-16.770992.dat |
| rename | sphere12-14-5-1-16.782581 |   9 | sphere12-14-5-1-16.782581.dat |
| rename | sphere12-14-5-1-16.794172 |  10 | sphere12-14-5-1-16.794172.dat |
| rename | sphere12-14-5-1-16.805763 |  11 | sphere12-14-5-1-16.805763.dat |
| rename | sphere12-14-5-1-16.817352 |  12 | sphere12-14-5-1-16.817352.dat |
| rename | sphere12-14-5-1-16.828943 |  13 | sphere12-14-5-1-16.828943.dat |
| rename | sphere12-14-5-1-16.840532 |  14 | sphere12-14-5-1-16.840532.dat |
| rename | sphere12-14-5-1-16.852123 |  15 | sphere12-14-5-1-16.852123.dat |
| rename | sphere12-14-5-1-16.863714 |  16 | sphere12-14-5-1-16.863714.dat |
| rename | sphere12-14-5-1-16.875303 |  17 | sphere12-14-5-1-16.875303.dat |
| rename | sphere12-14-5-1-16.886894 |  18 | sphere12-14-5-1-16.886894.dat |
| rename | sphere12-14-5-1-16.898483 |  19 | sphere12-14-5-1-16.898483.dat |
| rename | sphere12-14-5-1-16.910074 |  20 | sphere12-14-5-1-16.910074.dat |
| rename | sphere12-14-5-1-16.921663 |  21 | sphere12-14-5-1-16.921663.dat |
| rename | sphere12-14-5-1-16.933254 |  22 | sphere12-14-5-1-16.933254.dat |
| rename | sphere12-14-5-1-16.944845 |  23 | sphere12-14-5-1-16.944845.dat |
| rename | sphere12-14-5-1-16.956434 |  24 | sphere12-14-5-1-16.956434.dat |
| rename | sphere12-14-5-1-16.968025 |  25 | sphere12-14-5-1-16.968025.dat |
| rename | sphere12-14-5-1-16.979614 |  26 | sphere12-14-5-1-16.979614.dat |
| rename | sphere12-14-5-1-16.991205 |  27 | sphere12-14-5-1-16.991205.dat |
| rename | sphere12-14-5-1-17.002796 |  28 | sphere12-14-5-1-17.002796.dat |
| rename | sphere12-14-5-1-17.014385 |  29 | sphere12-14-5-1-17.014385.dat |
| rename | sphere12-14-5-1-17.025976 |  30 | sphere12-14-5-1-17.025976.dat |
| rename | sphere12-14-5-1-17.037565 |  31 | sphere12-14-5-1-17.037565.dat |
| rename | sphere12-14-5-1-17.049156 |  32 | sphere12-14-5-1-17.049156.dat |
| rename | sphere12-14-5-1-17.060747 |  33 | sphere12-14-5-1-17.060747.dat |
| rename | sphere12-14-5-1-17.072336 |  34 | sphere12-14-5-1-17.072336.dat |
| rename | sphere12-14-5-1-17.083927 |  35 | sphere12-14-5-1-17.083927.dat |
| rename | sphere12-14-5-1-17.095516 |  36 | sphere12-14-5-1-17.095516.dat |
| rename | sphere12-14-5-1-17.107107 |  37 | sphere12-14-5-1-17.107107.dat |
| rename | sphere12-14-5-1-17.118698 |  38 | sphere12-14-5-1-17.118698.dat |
| rename | sphere12-14-5-1-17.130287 |  39 | sphere12-14-5-1-17.130287.dat |
| rename | sphere12-14-5-1-17.141878 |  40 | sphere12-14-5-1-17.141878.dat |
| rename | sphere12-14-5-1-17.153467 |  41 | sphere12-14-5-1-17.153467.dat |
| rename | sphere12-14-5-1-17.165058 |  42 | sphere12-14-5-1-17.165058.dat |
| rename | sphere12-14-5-1-17.176649 |  43 | sphere12-14-5-1-17.176649.dat |
| rename | sphere12-14-5-1-17.188238 |  44 | sphere12-14-5-1-17.188238.dat |
| rename | sphere12-14-5-1-17.199829 |  45 | sphere12-14-5-1-17.199829.dat |
| rename | sphere12-14-5-1-17.211418 |  46 | sphere12-14-5-1-17.211418.dat |
| rename | sphere12-14-5-1-17.223009 |  47 | sphere12-14-5-1-17.223009.dat |
| rename | sphere12-14-5-1-17.234598 |  48 | sphere12-14-5-1-17.234598.dat |
| rename | sphere12-14-5-1-17.246189 |  49 | sphere12-14-5-1-17.246189.dat |
| rename | sphere12-14-5-1-17.257780 |  50 | sphere12-14-5-1-17.257780.dat |
| rename | sphere12-14-5-1-17.269369 |  51 | sphere12-14-5-1-17.269369.dat |
| rename | sphere12-14-5-1-17.280960 |  52 | sphere12-14-5-1-17.280960.dat |
| rename | sphere12-14-5-1-17.292549 |  53 | sphere12-14-5-1-17.292549.dat |
| rename | sphere12-14-5-1-17.304140 |  54 | sphere12-14-5-1-17.304140.dat |
| rename | sphere12-14-5-1-17.315731 |  55 | sphere12-14-5-1-17.315731.dat |
| rename | sphere12-14-5-1-17.327320 |  56 | sphere12-14-5-1-17.327320.dat |
| rename | sphere12-14-5-1-17.338911 |  57 | sphere12-14-5-1-17.338911.dat |
| rename | sphere12-14-5-1-17.350500 |  58 | sphere12-14-5-1-17.350500.dat |
| rename | sphere12-14-5-1-17.362091 |  59 | sphere12-14-5-1-17.362091.dat |
| rename | sphere12-14-5-1-17.373682 |  60 | sphere12-14-5-1-17.373682.dat |
| rename | sphere12-14-5-1-17.385271 |  61 | sphere12-14-5-1-17.385271.dat |
| rename | sphere12-14-5-1-17.396862 |  62 | sphere12-14-5-1-17.396862.dat |
| rename | sphere12-14-5-1-17.408451 |  63 | sphere12-14-5-1-17.408451.dat |
| rename | sphere12-14-5-1-17.420042 |  64 | sphere12-14-5-1-17.420042.dat |
| rename | sphere12-14-5-1-17.431633 |  65 | sphere12-14-5-1-17.431633.dat |
| rename | sphere12-14-5-1-17.443222 |  66 | sphere12-14-5-1-17.443222.dat |
| rename | sphere12-14-5-1-17.454813 |  67 | sphere12-14-5-1-17.454813.dat |
| rename | sphere12-14-5-1-17.466402 |  68 | sphere12-14-5-1-17.466402.dat |
| rename | sphere12-14-5-1-17.477993 |  69 | sphere12-14-5-1-17.477993.dat |
| rename | sphere12-14-5-1-17.489584 |  70 | sphere12-14-5-1-17.489584.dat |
| rename | sphere12-14-5-1-17.501173 |  71 | sphere12-14-5-1-17.501173.dat |
| rename | sphere12-14-5-1-17.512764 |  72 | sphere12-14-5-1-17.512764.dat |
| rename | sphere12-14-5-1-17.524353 |  73 | sphere12-14-5-1-17.524353.dat |
| rename | sphere12-14-5-1-17.535944 |  74 | sphere12-14-5-1-17.535944.dat |
| rename | sphere12-14-5-1-17.547535 |  75 | sphere12-14-5-1-17.547535.dat |
| rename | sphere12-14-5-1-17.559124 |  76 | sphere12-14-5-1-17.559124.dat |
| rename | sphere12-14-5-1-17.570715 |  77 | sphere12-14-5-1-17.570715.dat |
| rename | sphere12-14-5-1-17.582304 |  78 | sphere12-14-5-1-17.582304.dat |
| rename | sphere12-14-5-1-17.593895 |  79 | sphere12-14-5-1-17.593895.dat |
| rename | sphere12-14-5-1-17.605484 |  80 | sphere12-14-5-1-17.605484.dat |
| rename | sphere12-14-5-1-17.617075 |  81 | sphere12-14-5-1-17.617075.dat |
| rename | sphere12-14-5-1-17.628666 |  82 | sphere12-14-5-1-17.628666.dat |
| rename | sphere12-14-5-1-17.640255 |  83 | sphere12-14-5-1-17.640255.dat |
| rename | sphere12-14-5-1-17.651846 |  84 | sphere12-14-5-1-17.651846.dat |
| rename | sphere12-14-5-1-17.663435 |  85 | sphere12-14-5-1-17.663435.dat |
| rename | sphere12-14-5-1-17.675026 |  86 | sphere12-14-5-1-17.675026.dat |
| rename | sphere12-14-5-1-17.686617 |  87 | sphere12-14-5-1-17.686617.dat |
| rename | sphere12-14-5-1-17.698206 |  88 | sphere12-14-5-1-17.698206.dat |
| rename | sphere12-14-5-1-17.709797 |  89 | sphere12-14-5-1-17.709797.dat |
| rename | sphere12-14-5-1-17.721386 |  90 | sphere12-14-5-1-17.721386.dat |
| rename | sphere12-14-5-1-17.732977 |  91 | sphere12-14-5-1-17.732977.dat |
| rename | sphere12-14-5-1-17.744568 |  92 | sphere12-14-5-1-17.744568.dat |
| rename | sphere12-14-5-1-17.756157 |  93 | sphere12-14-5-1-17.756157.dat |
| rename | sphere12-14-5-1-17.767748 |  94 | sphere12-14-5-1-17.767748.dat |
| rename | sphere12-14-5-1-17.779337 |  95 | sphere12-14-5-1-17.779337.dat |
| rename | sphere12-14-5-1-17.790928 |  96 | sphere12-14-5-1-17.790928.dat |
| rename | sphere12-14-5-1-17.802519 |  97 | sphere12-14-5-1-17.802519.dat |
| rename | sphere12-14-5-1-17.814108 |  98 | sphere12-14-5-1-17.814108.dat |
| rename | sphere12-14-5-1-17.825699 |  99 | sphere12-14-5-1-17.825699.dat |
| rename | sphere12-14-5-1-17.837288 | 100 | sphere12-14-5-1-17.837288.dat |
| rename | sphere12-14-5-1-17.848879 | 101 | sphere12-14-5-1-17.848879.dat |
| rename | sphere12-14-5-1-17.860470 | 102 | sphere12-14-5-1-17.860470.dat |
| rename | sphere12-14-5-1-17.872059 | 103 | sphere12-14-5-1-17.872059.dat |
| rename | sphere12-14-5-1-17.883650 | 104 | sphere12-14-5-1-17.883650.dat |
| rename | sphere12-14-5-1-17.895239 | 105 | sphere12-14-5-1-17.895239.dat |
| rename | sphere12-14-5-1-17.906830 | 106 | sphere12-14-5-1-17.906830.dat |
| rename | sphere12-14-5-1-17.918419 | 107 | sphere12-14-5-1-17.918419.dat |
| rename | sphere12-14-5-1-17.930010 | 108 | sphere12-14-5-1-17.930010.dat |
| rename | sphere12-14-5-1-17.941601 | 109 | sphere12-14-5-1-17.941601.dat |
| rename | sphere12-14-5-1-17.953190 | 110 | sphere12-14-5-1-17.953190.dat |
| rename | sphere12-14-5-1-17.964781 | 111 | sphere12-14-5-1-17.964781.dat |
| rename | sphere12-14-5-1-17.976370 | 112 | sphere12-14-5-1-17.976370.dat |
| rename | sphere12-14-5-1-17.987961 | 113 | sphere12-14-5-1-17.987961.dat |
| rename | sphere12-14-5-1-17.999552 | 114 | sphere12-14-5-1-17.999552.dat |
| rename | sphere12-14-5-1-18.011141 | 115 | sphere12-14-5-1-18.011141.dat |
| rename | sphere12-14-5-1-18.022732 | 116 | sphere12-14-5-1-18.022732.dat |
| rename | sphere12-14-5-1-18.034321 | 117 | sphere12-14-5-1-18.034321.dat |
| rename | sphere12-14-5-1-18.045912 | 118 | sphere12-14-5-1-18.045912.dat |
| rename | sphere12-14-5-1-18.057503 | 119 | sphere12-14-5-1-18.057503.dat |
| rename | sphere12-14-5-1-18.069092 | 120 | sphere12-14-5-1-18.069092.dat |
| rename | sphere12-14-5-1-18.080683 | 121 | sphere12-14-5-1-18.080683.dat |
| rename | sphere12-14-5-1-18.092272 | 122 | sphere12-14-5-1-18.092272.dat |
| rename | sphere12-14-5-1-18.103863 | 123 | sphere12-14-5-1-18.103863.dat |
| rename | sphere12-14-5-1-18.115454 | 124 | sphere12-14-5-1-18.115454.dat |
| rename | sphere12-14-5-1-18.127043 | 125 | sphere12-14-5-1-18.127043.dat |
| rename | sphere12-14-5-1-18.138634 | 126 | sphere12-14-5-1-18.138634.dat |
| rename | sphere12-14-5-1-18.150223 | 127 | sphere12-14-5-1-18.150223.dat |
| rename | sphere12-14-5-1-18.161814 | 128 | sphere12-14-5-1-18.161814.dat |
| rename | sphere12-14-5-1-18.173405 | 129 | sphere12-14-5-1-18.173405.dat |
| rename | sphere12-14-5-1-18.184994 | 130 | sphere12-14-5-1-18.184994.dat |
| rename | sphere12-14-5-1-18.196585 | 131 | sphere12-14-5-1-18.196585.dat |
| rename | sphere12-14-5-1-18.208174 | 132 | sphere12-14-5-1-18.208174.dat |
| rename | sphere12-14-5-1-18.219765 | 133 | sphere12-14-5-1-18.219765.dat |
| rename | sphere12-14-5-1-18.231354 | 134 | sphere12-14-5-1-18.231354.dat |
| rename | sphere12-14-5-1-18.242945 | 135 | sphere12-14-5-1-18.242945.dat |
| rename | sphere12-14-5-1-18.254536 | 136 | sphere12-14-5-1-18.254536.dat |
| rename | sphere12-14-5-1-18.266125 | 137 | sphere12-14-5-1-18.266125.dat |
| rename | sphere12-14-5-1-18.277716 | 138 | sphere12-14-5-1-18.277716.dat |
| rename | sphere12-14-5-1-18.289305 | 139 | sphere12-14-5-1-18.289305.dat |
| rename | sphere12-14-5-1-18.300896 | 140 | sphere12-14-5-1-18.300896.dat |
| rename | sphere12-14-5-1-18.312487 | 141 | sphere12-14-5-1-18.312487.dat |
| rename | sphere12-14-5-1-18.324076 | 142 | sphere12-14-5-1-18.324076.dat |
| rename | sphere12-14-5-1-18.335667 | 143 | sphere12-14-5-1-18.335667.dat |
| rename | sphere12-14-5-1-18.347256 | 144 | sphere12-14-5-1-18.347256.dat |
| rename | sphere12-14-5-1-18.358847 | 145 | sphere12-14-5-1-18.358847.dat |
| rename | sphere12-14-5-1-18.370438 | 146 | sphere12-14-5-1-18.370438.dat |
| rename | sphere12-14-5-1-18.382027 | 147 | sphere12-14-5-1-18.382027.dat |
| rename | sphere12-14-5-1-18.393618 | 148 | sphere12-14-5-1-18.393618.dat |
| rename | sphere12-14-5-1-18.405207 | 149 | sphere12-14-5-1-18.405207.dat |
| rename | sphere12-14-5-1-18.416798 | 150 | sphere12-14-5-1-18.416798.dat |
| rename | sphere12-14-5-1-18.428387 | 151 | sphere12-14-5-1-18.428387.dat |
| rename | sphere12-14-5-1-18.439978 | 152 | sphere12-14-5-1-18.439978.dat |
| rename | sphere12-14-5-1-18.451567 | 153 | sphere12-14-5-1-18.451567.dat |
| rename | sphere12-14-5-1-18.463158 | 154 | sphere12-14-5-1-18.463158.dat |
| rename | sphere12-14-5-1-18.474749 | 155 | sphere12-14-5-1-18.474749.dat |
| rename | sphere12-14-5-1-18.486338 | 156 | sphere12-14-5-1-18.486338.dat |
| rename | sphere12-14-5-1-18.497929 | 157 | sphere12-14-5-1-18.497929.dat |
| rename | sphere12-14-5-1-18.509518 | 158 | sphere12-14-5-1-18.509518.dat |
| rename | sphere12-14-5-1-18.521109 | 159 | sphere12-14-5-1-18.521109.dat |
| rename | sphere12-14-5-1-18.532700 | 160 | sphere12-14-5-1-18.532700.dat |
| rename | sphere12-14-5-1-18.544289 | 161 | sphere12-14-5-1-18.544289.dat |
| rename | sphere12-14-5-1-18.555880 | 162 | sphere12-14-5-1-18.555880.dat |
| rename | sphere12-14-5-1-18.567469 | 163 | sphere12-14-5-1-18.567469.dat |
| rename | sphere12-14-5-1-18.579060 | 164 | sphere12-14-5-1-18.579060.dat |
| rename | sphere12-14-5-1-18.590649 | 165 | sphere12-14-5-1-18.590649.dat |
| rename | sphere12-14-5-1-18.602240 | 166 | sphere12-14-5-1-18.602240.dat |
| rename | sphere12-14-5-1-18.613831 | 167 | sphere12-14-5-1-18.613831.dat |
| rename | sphere12-14-5-1-18.625420 | 168 | sphere12-14-5-1-18.625420.dat |
| rename | sphere12-14-5-1-18.637011 | 169 | sphere12-14-5-1-18.637011.dat |
| rename | sphere12-14-5-1-18.648600 | 170 | sphere12-14-5-1-18.648600.dat |
| rename | sphere12-14-5-1-18.660191 | 171 | sphere12-14-5-1-18.660191.dat |
| rename | sphere12-14-5-1-18.671782 | 172 | sphere12-14-5-1-18.671782.dat |
| rename | sphere12-14-5-1-18.683371 | 173 | sphere12-14-5-1-18.683371.dat |
| rename | sphere12-14-5-1-18.694962 | 174 | sphere12-14-5-1-18.694962.dat |
| rename | sphere12-14-5-1-18.706551 | 175 | sphere12-14-5-1-18.706551.dat |
| rename | sphere12-14-5-1-18.718142 | 176 | sphere12-14-5-1-18.718142.dat |
| rename | sphere12-14-5-1-18.729733 | 177 | sphere12-14-5-1-18.729733.dat |
| rename | sphere12-14-5-1-18.741322 | 178 | sphere12-14-5-1-18.741322.dat |
| rename | sphere12-14-5-1-18.752913 | 179 | sphere12-14-5-1-18.752913.dat |
| rename | sphere12-14-5-1-18.764502 | 180 | sphere12-14-5-1-18.764502.dat |
| rename | sphere12-14-5-1-18.776093 | 181 | sphere12-14-5-1-18.776093.dat |
| rename | sphere12-14-5-1-18.787683 | 182 | sphere12-14-5-1-18.787683.dat |
| rename | sphere12-14-5-1-18.799273 | 183 | sphere12-14-5-1-18.799273.dat |
| rename | sphere12-14-5-1-18.810863 | 184 | sphere12-14-5-1-18.810863.dat |
| rename | sphere12-14-5-1-18.822453 | 185 | sphere12-14-5-1-18.822453.dat |


rename第二列是要替换的表达式  第三列是要替换的形式(缩列形式)  第四列是文件名

#+RESULTS: TEST rename file to 1,2,3

*** 2.1 Rename 

****  cas


#+NAME:  rename cas file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw5"
   ls *.cas|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-5-1-";postfix=".cas"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "i" "originalFile""postfix;i=i+1;system(cmd);}'

#+END_SRC

#+RESULTS: rename cas file to 1,2,3

****  dat


#+NAME:  rename dat file to 1,2,3
#+BEGIN_SRC bash :dir "M:\\fluentYaw5"
   ls *.dat|awk -F"-" 'BEGIN{i=1;prefix="sphere12-14-5-1-";postfix=".dat"}
     {originalFile=prefix""substr($5,0,length($5)-4);cmd="rename "originalFile" "i" "originalFile""postfix;i=i+1;system(cmd);}'

#+END_SRC

#+RESULTS: rename dat file to 1,2,3


开始进行tecplot处理

****  tecplot

需要把tecplot路径放到path中! 事先录制好脚本，安排好文件名字！

#+BEGIN_SRC bash :dir "M:\\fluentYaw5"  :async t
  tec360.exe fluent17.mcr
#+END_SRC

#+RESULTS:


***  3. Recovery Tests

#+BEGIN_SRC bash :dir "M:\\fluentYaw5\\"
  cat sphere*.csv|awk -F, 'BEGIN{prefix="sphere12-14-15-1-";postfix=".cas"}
{output=prefix""substr($1,0,length($1)-1)""postfix;input=sprintf("%03d",$2)""postfix;cmd="rename "input" "output" "input;print cmd;}'

#+END_SRC

#+RESULTS:
| rename | 001.cas | sphere12-14-15-1-11.682901.cas | 001.cas |
| rename | 002.cas | sphere12-14-15-1-11.700288.cas | 002.cas |
| rename | 003.cas | sphere12-14-15-1-11.711878.cas | 003.cas |
| rename | 004.cas | sphere12-14-15-1-11.723468.cas | 004.cas |
| rename | 005.cas | sphere12-14-15-1-11.735058.cas | 005.cas |
| rename | 006.cas | sphere12-14-15-1-11.746648.cas | 006.cas |
| rename | 007.cas | sphere12-14-15-1-11.758239.cas | 007.cas |
| rename | 008.cas | sphere12-14-15-1-11.769829.cas | 008.cas |
| rename | 009.cas | sphere12-14-15-1-11.781419.cas | 009.cas |
| rename | 010.cas | sphere12-14-15-1-11.793009.cas | 010.cas |
| rename | 011.cas | sphere12-14-15-1-11.804599.cas | 011.cas |
| rename | 012.cas | sphere12-14-15-1-11.816189.cas | 012.cas |
| rename | 013.cas | sphere12-14-15-1-11.827780.cas | 013.cas |
| rename | 014.cas | sphere12-14-15-1-11.839370.cas | 014.cas |
| rename | 015.cas | sphere12-14-15-1-11.850960.cas | 015.cas |
| rename | 016.cas | sphere12-14-15-1-11.862550.cas | 016.cas |
| rename | 017.cas | sphere12-14-15-1-11.874140.cas | 017.cas |
| rename | 018.cas | sphere12-14-15-1-11.885731.cas | 018.cas |
| rename | 019.cas | sphere12-14-15-1-11.897321.cas | 019.cas |
| rename | 020.cas | sphere12-14-15-1-11.908911.cas | 020.cas |
| rename | 021.cas | sphere12-14-15-1-11.920501.cas | 021.cas |
| rename | 022.cas | sphere12-14-15-1-11.932091.cas | 022.cas |
| rename | 023.cas | sphere12-14-15-1-11.943681.cas | 023.cas |
| rename | 024.cas | sphere12-14-15-1-11.955272.cas | 024.cas |
| rename | 025.cas | sphere12-14-15-1-11.966862.cas | 025.cas |
| rename | 026.cas | sphere12-14-15-1-11.978452.cas | 026.cas |
| rename | 027.cas | sphere12-14-15-1-11.990042.cas | 027.cas |
| rename | 028.cas | sphere12-14-15-1-12.001632.cas | 028.cas |
| rename | 029.cas | sphere12-14-15-1-12.013223.cas | 029.cas |
| rename | 030.cas | sphere12-14-15-1-12.024813.cas | 030.cas |
| rename | 031.cas | sphere12-14-15-1-12.036403.cas | 031.cas |
| rename | 032.cas | sphere12-14-15-1-12.047993.cas | 032.cas |
| rename | 033.cas | sphere12-14-15-1-12.059583.cas | 033.cas |
| rename | 034.cas | sphere12-14-15-1-12.071174.cas | 034.cas |
| rename | 035.cas | sphere12-14-15-1-12.082764.cas | 035.cas |
| rename | 036.cas | sphere12-14-15-1-12.094354.cas | 036.cas |
| rename | 037.cas | sphere12-14-15-1-12.105944.cas | 037.cas |
| rename | 038.cas | sphere12-14-15-1-12.117534.cas | 038.cas |
| rename | 039.cas | sphere12-14-15-1-12.129124.cas | 039.cas |
| rename | 040.cas | sphere12-14-15-1-12.140715.cas | 040.cas |
| rename | 041.cas | sphere12-14-15-1-12.152305.cas | 041.cas |
| rename | 042.cas | sphere12-14-15-1-12.163895.cas | 042.cas |
| rename | 043.cas | sphere12-14-15-1-12.175485.cas | 043.cas |
| rename | 044.cas | sphere12-14-15-1-12.187075.cas | 044.cas |
| rename | 045.cas | sphere12-14-15-1-12.198666.cas | 045.cas |
| rename | 046.cas | sphere12-14-15-1-12.210256.cas | 046.cas |
| rename | 047.cas | sphere12-14-15-1-12.221846.cas | 047.cas |
| rename | 048.cas | sphere12-14-15-1-12.233436.cas | 048.cas |
| rename | 049.cas | sphere12-14-15-1-12.245026.cas | 049.cas |
| rename | 050.cas | sphere12-14-15-1-12.256617.cas | 050.cas |
| rename | 051.cas | sphere12-14-15-1-12.268207.cas | 051.cas |
| rename | 052.cas | sphere12-14-15-1-12.279797.cas | 052.cas |
| rename | 053.cas | sphere12-14-15-1-12.291387.cas | 053.cas |
| rename | 054.cas | sphere12-14-15-1-12.302977.cas | 054.cas |
| rename | 055.cas | sphere12-14-15-1-12.314567.cas | 055.cas |
| rename | 056.cas | sphere12-14-15-1-12.326158.cas | 056.cas |
| rename | 057.cas | sphere12-14-15-1-12.337748.cas | 057.cas |
| rename | 058.cas | sphere12-14-15-1-12.349338.cas | 058.cas |
| rename | 059.cas | sphere12-14-15-1-12.360928.cas | 059.cas |
| rename | 060.cas | sphere12-14-15-1-12.372518.cas | 060.cas |
| rename | 061.cas | sphere12-14-15-1-12.384109.cas | 061.cas |
| rename | 062.cas | sphere12-14-15-1-12.395699.cas | 062.cas |
| rename | 063.cas | sphere12-14-15-1-12.407289.cas | 063.cas |
| rename | 064.cas | sphere12-14-15-1-12.418879.cas | 064.cas |
| rename | 065.cas | sphere12-14-15-1-12.430469.cas | 065.cas |
| rename | 066.cas | sphere12-14-15-1-12.442059.cas | 066.cas |
| rename | 067.cas | sphere12-14-15-1-12.453650.cas | 067.cas |
| rename | 068.cas | sphere12-14-15-1-12.465240.cas | 068.cas |
| rename | 069.cas | sphere12-14-15-1-12.476830.cas | 069.cas |
| rename | 070.cas | sphere12-14-15-1-12.488420.cas | 070.cas |
| rename | 071.cas | sphere12-14-15-1-12.500010.cas | 071.cas |
| rename | 072.cas | sphere12-14-15-1-12.511600.cas | 072.cas |
| rename | 073.cas | sphere12-14-15-1-12.523190.cas | 073.cas |
| rename | 074.cas | sphere12-14-15-1-12.534781.cas | 074.cas |
| rename | 075.cas | sphere12-14-15-1-12.546371.cas | 075.cas |
| rename | 076.cas | sphere12-14-15-1-12.557961.cas | 076.cas |
| rename | 077.cas | sphere12-14-15-1-12.569551.cas | 077.cas |
| rename | 078.cas | sphere12-14-15-1-12.581141.cas | 078.cas |
| rename | 079.cas | sphere12-14-15-1-12.592731.cas | 079.cas |
| rename | 080.cas | sphere12-14-15-1-12.604321.cas | 080.cas |
| rename | 081.cas | sphere12-14-15-1-12.615911.cas | 081.cas |
| rename | 082.cas | sphere12-14-15-1-12.627501.cas | 082.cas |
| rename | 083.cas | sphere12-14-15-1-12.639092.cas | 083.cas |
| rename | 084.cas | sphere12-14-15-1-12.650682.cas | 084.cas |
| rename | 085.cas | sphere12-14-15-1-12.662272.cas | 085.cas |
| rename | 086.cas | sphere12-14-15-1-12.673862.cas | 086.cas |
| rename | 087.cas | sphere12-14-15-1-12.685452.cas | 087.cas |
| rename | 088.cas | sphere12-14-15-1-12.697042.cas | 088.cas |
| rename | 089.cas | sphere12-14-15-1-12.708633.cas | 089.cas |
| rename | 090.cas | sphere12-14-15-1-12.720223.cas | 090.cas |
| rename | 091.cas | sphere12-14-15-1-12.731813.cas | 091.cas |
| rename | 092.cas | sphere12-14-15-1-12.743403.cas | 092.cas |
| rename | 093.cas | sphere12-14-15-1-12.754993.cas | 093.cas |
| rename | 094.cas | sphere12-14-15-1-12.766584.cas | 094.cas |
| rename | 095.cas | sphere12-14-15-1-12.778174.cas | 095.cas |
| rename | 096.cas | sphere12-14-15-1-12.789764.cas | 096.cas |
| rename | 097.cas | sphere12-14-15-1-12.801354.cas | 097.cas |
| rename | 098.cas | sphere12-14-15-1-12.812944.cas | 098.cas |
| rename | 099.cas | sphere12-14-15-1-12.824535.cas | 099.cas |
| rename | 100.cas | sphere12-14-15-1-12.836125.cas | 100.cas |
| rename | 101.cas | sphere12-14-15-1-12.847715.cas | 101.cas |
| rename | 102.cas | sphere12-14-15-1-12.859305.cas | 102.cas |
| rename | 103.cas | sphere12-14-15-1-12.870895.cas | 103.cas |
| rename | 104.cas | sphere12-14-15-1-12.882486.cas | 104.cas |
| rename | 105.cas | sphere12-14-15-1-12.894076.cas | 105.cas |
| rename | 106.cas | sphere12-14-15-1-12.905666.cas | 106.cas |
| rename | 107.cas | sphere12-14-15-1-12.917256.cas | 107.cas |
| rename | 108.cas | sphere12-14-15-1-12.928846.cas | 108.cas |
| rename | 109.cas | sphere12-14-15-1-12.940437.cas | 109.cas |
| rename | 110.cas | sphere12-14-15-1-12.952027.cas | 110.cas |
| rename | 111.cas | sphere12-14-15-1-12.963617.cas | 111.cas |
| rename | 112.cas | sphere12-14-15-1-12.975207.cas | 112.cas |
| rename | 113.cas | sphere12-14-15-1-12.986797.cas | 113.cas |
| rename | 114.cas | sphere12-14-15-1-12.998387.cas | 114.cas |
| rename | 115.cas | sphere12-14-15-1-13.009977.cas | 115.cas |
| rename | 116.cas | sphere12-14-15-1-13.021568.cas | 116.cas |
| rename | 117.cas | sphere12-14-15-1-13.033158.cas | 117.cas |
| rename | 118.cas | sphere12-14-15-1-13.044748.cas | 118.cas |
| rename | 119.cas | sphere12-14-15-1-13.056338.cas | 119.cas |
| rename | 120.cas | sphere12-14-15-1-13.067928.cas | 120.cas |
| rename | 121.cas | sphere12-14-15-1-13.079519.cas | 121.cas |
| rename | 122.cas | sphere12-14-15-1-13.091109.cas | 122.cas |
| rename | 123.cas | sphere12-14-15-1-13.102699.cas | 123.cas |
| rename | 124.cas | sphere12-14-15-1-13.114289.cas | 124.cas |
| rename | 125.cas | sphere12-14-15-1-13.125879.cas | 125.cas |
| rename | 126.cas | sphere12-14-15-1-13.137470.cas | 126.cas |
| rename | 127.cas | sphere12-14-15-1-13.149060.cas | 127.cas |
| rename | 128.cas | sphere12-14-15-1-13.160650.cas | 128.cas |
| rename | 129.cas | sphere12-14-15-1-13.172240.cas | 129.cas |
| rename | 130.cas | sphere12-14-15-1-13.183830.cas | 130.cas |
| rename | 131.cas | sphere12-14-15-1-13.195421.cas | 131.cas |
| rename | 132.cas | sphere12-14-15-1-13.207011.cas | 132.cas |
| rename | 133.cas | sphere12-14-15-1-13.218601.cas | 133.cas |
| rename | 134.cas | sphere12-14-15-1-13.230191.cas | 134.cas |
| rename | 135.cas | sphere12-14-15-1-13.241781.cas | 135.cas |
| rename | 136.cas | sphere12-14-15-1-13.253372.cas | 136.cas |
| rename | 137.cas | sphere12-14-15-1-13.264962.cas | 137.cas |
| rename | 138.cas | sphere12-14-15-1-13.276552.cas | 138.cas |
| rename | 139.cas | sphere12-14-15-1-13.288142.cas | 139.cas |
| rename | 140.cas | sphere12-14-15-1-13.299732.cas | 140.cas |
| rename | 141.cas | sphere12-14-15-1-13.311322.cas | 141.cas |
| rename | 142.cas | sphere12-14-15-1-13.322913.cas | 142.cas |
| rename | 143.cas | sphere12-14-15-1-13.334503.cas | 143.cas |
| rename | 144.cas | sphere12-14-15-1-13.346093.cas | 144.cas |
| rename | 145.cas | sphere12-14-15-1-13.357683.cas | 145.cas |
| rename | 146.cas | sphere12-14-15-1-13.369273.cas | 146.cas |
| rename | 147.cas | sphere12-14-15-1-13.380863.cas | 147.cas |
| rename | 148.cas | sphere12-14-15-1-13.392454.cas | 148.cas |
| rename | 149.cas | sphere12-14-15-1-13.404044.cas | 149.cas |
| rename | 150.cas | sphere12-14-15-1-13.415634.cas | 150.cas |
| rename | 151.cas | sphere12-14-15-1-13.427224.cas | 151.cas |
| rename | 152.cas | sphere12-14-15-1-13.438815.cas | 152.cas |
| rename | 153.cas | sphere12-14-15-1-13.450405.cas | 153.cas |
| rename | 154.cas | sphere12-14-15-1-13.461995.cas | 154.cas |
| rename | 155.cas | sphere12-14-15-1-13.473585.cas | 155.cas |
| rename | 156.cas | sphere12-14-15-1-13.485175.cas | 156.cas |
| rename | 157.cas | sphere12-14-15-1-13.496766.cas | 157.cas |
| rename | 158.cas | sphere12-14-15-1-13.508356.cas | 158.cas |
| rename | 159.cas | sphere12-14-15-1-13.519946.cas | 159.cas |
| rename | 160.cas | sphere12-14-15-1-13.531536.cas | 160.cas |
| rename | 161.cas | sphere12-14-15-1-13.543126.cas | 161.cas |
| rename | 162.cas | sphere12-14-15-1-13.554716.cas | 162.cas |
| rename | 163.cas | sphere12-14-15-1-13.566307.cas | 163.cas |
| rename | 164.cas | sphere12-14-15-1-13.577897.cas | 164.cas |
| rename | 165.cas | sphere12-14-15-1-13.589487.cas | 165.cas |
| rename | 166.cas | sphere12-14-15-1-13.601077.cas | 166.cas |
| rename | 167.cas | sphere12-14-15-1-13.612667.cas | 167.cas |
| rename | 168.cas | sphere12-14-15-1-13.624258.cas | 168.cas |
| rename | 169.cas | sphere12-14-15-1-13.635848.cas | 169.cas |
| rename | 170.cas | sphere12-14-15-1-13.647438.cas | 170.cas |
| rename | 171.cas | sphere12-14-15-1-13.659028.cas | 171.cas |
| rename | 172.cas | sphere12-14-15-1-13.670618.cas | 172.cas |
| rename | 173.cas | sphere12-14-15-1-13.682208.cas | 173.cas |
| rename | 174.cas | sphere12-14-15-1-13.693799.cas | 174.cas |
| rename | 175.cas | sphere12-14-15-1-13.705389.cas | 175.cas |
| rename | 176.cas | sphere12-14-15-1-13.716979.cas | 176.cas |
| rename | 177.cas | sphere12-14-15-1-13.728569.cas | 177.cas |
| rename | 178.cas | sphere12-14-15-1-13.740159.cas | 178.cas |
| rename | 179.cas | sphere12-14-15-1-13.751750.cas | 179.cas |
| rename | 180.cas | sphere12-14-15-1-13.763340.cas | 180.cas |
| rename | 181.cas | sphere12-14-15-1-13.774930.cas | 181.cas |
| rename | 182.cas | sphere12-14-15-1-13.786520.cas | 182.cas |
| rename | 183.cas | sphere12-14-15-1-13.798110.cas | 183.cas |
| rename | 184.cas | sphere12-14-15-1-13.809701.cas | 184.cas |
| rename | 185.cas | sphere12-14-15-1-13.821291.cas | 185.cas |
| rename | 186.cas | sphere12-14-15-1-13.832881.cas | 186.cas |
| rename | 187.cas | sphere12-14-15-1-13.844471.cas | 187.cas |
| rename | 188.cas | sphere12-14-15-1-13.856061.cas | 188.cas |
| rename | 189.cas | sphere12-14-15-1-13.867651.cas | 189.cas |
| rename | 190.cas | sphere12-14-15-1-13.879242.cas | 190.cas |
| rename | 191.cas | sphere12-14-15-1-13.890832.cas | 191.cas |
| rename | 192.cas | sphere12-14-15-1-13.902422.cas | 192.cas |
| rename | 193.cas | sphere12-14-15-1-13.914012.cas | 193.cas |
| rename | 194.cas | sphere12-14-15-1-13.925602.cas | 194.cas |
| rename | 195.cas | sphere12-14-15-1-13.937193.cas | 195.cas |
| rename | 196.cas | sphere12-14-15-1-13.948783.cas | 196.cas |
| rename | 197.cas | sphere12-14-15-1-13.960373.cas | 197.cas |
| rename | 198.cas | sphere12-14-15-1-13.971963.cas | 198.cas |
| rename | 199.cas | sphere12-14-15-1-13.983553.cas | 199.cas |
| rename | 200.cas | sphere12-14-15-1-13.995144.cas | 200.cas |
| rename | 201.cas | sphere12-14-15-1-14.006734.cas | 201.cas |
| rename | 202.cas | sphere12-14-15-1-14.018324.cas | 202.cas |
| rename | 203.cas | sphere12-14-15-1-14.029914.cas | 203.cas |
| rename | 204.cas | sphere12-14-15-1-14.041504.cas | 204.cas |
| rename | 205.cas | sphere12-14-15-1-14.053094.cas | 205.cas |
| rename | 206.cas | sphere12-14-15-1-14.064685.cas | 206.cas |
| rename | 207.cas | sphere12-14-15-1-14.076275.cas | 207.cas |
| rename | 208.cas | sphere12-14-15-1-14.087865.cas | 208.cas |
| rename | 209.cas | sphere12-14-15-1-14.099455.cas | 209.cas |
| rename | 210.cas | sphere12-14-15-1-14.111045.cas | 210.cas |
| rename | 211.cas | sphere12-14-15-1-14.122636.cas | 211.cas |
| rename | 212.cas | sphere12-14-15-1-14.134226.cas | 212.cas |
| rename | 213.cas | sphere12-14-15-1-14.145816.cas | 213.cas |
| rename | 214.cas | sphere12-14-15-1-14.168996.cas | 214.cas |
| rename | 215.cas | sphere12-14-15-1-14.180586.cas | 215.cas |
| rename | 216.cas | sphere12-14-15-1-14.192177.cas | 216.cas |

*** 3.1 Recovery


****  cas


#+BEGIN_SRC bash :dir "M:\\fluentYaw5\\\\"
  cat sphere*.csv|awk -F, 'BEGIN{prefix="sphere12-14-15-1-";postfix=".cas"}
{output=prefix""substr($1,0,length($1)-1)""postfix;input=sprintf("%03d",$2)""postfix;cmd="rename "input" "output" "input;system(cmd);}'

#+END_SRC

#+RESULTS:

****  dat



#+BEGIN_SRC bash :dir "M:\\fluentYaw5\\\\"
  cat sphere*.csv|awk -F, 'BEGIN{prefix="sphere12-14-15-1-";postfix=".dat"}
{output=prefix""substr($1,0,length($1)-1)""postfix;input=sprintf("%03d",$2)""postfix;cmd="rename "input" "output" "input;system(cmd);}'

#+END_SRC

#+RESULTS:




#+BEGIN_SRC R
  v <- c(2.4,5,6);
  t <- c(8,3,4);
  print(v/t);
#+END_SRC

#+RESULTS:
|              0.3 |
| 1.66666666666667 |
|              1.5 |



#+BEGIN_SRC R
  list1 <- list(c(2,4,3),21,'apple',sin);
  print(list1[1]);
#+END_SRC

#+RESULTS:
| 2 |
| 4 |
| 3 |
